# Belajar pandas

## #01: Menyertakan prefix dan suffix pada kolom data frame

In [199]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [200]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  9  5  4  7  6
1  3  2  2  9  4
2  4  3  3  3  4
3  3  9  8  7  4
4  8  4  5  4  6

In [201]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [202]:
# Menyertakan prefix kolom
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        9        5        4        7        6
1        3        2        2        9        4
2        4        3        3        3        4
3        3        9        8        7        4
4        8        4        5        4        6

In [203]:
#Menyertakan sufix kolom
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        9        5        4        7        6
1        3        2        2        9        4
2        4        3        3        3        4
3        3        9        8        7        4
4        8        4        5        4        6

## #02: Pemilihan baris (rows selection) pada data frame

In [204]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  2  3  2  4  4
1  2  2  1  4  3
2  2  3  1  3  1
3  3  4  2  3  4
4  2  1  4  3  2
5  4  3  1  3  1
6  2  4  2  1  1
7  2  3  2  2  1
8  2  4  2  1  3
9  1  3  4  2  4

In [205]:
# Selection dengan operator logika | (or)
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
3  3  4  2  3  4
9  1  3  4  2  4

In [206]:
# Selection dengan fungsi isin()
df[df['A'].isin([1,3])]

   A  B  C  D  E
3  3  4  2  3  4
9  1  3  4  2  4

In [207]:
# Mengenal operator negasi ~
df[~df['A'].isin([1,3])]

   A  B  C  D  E
0  2  3  2  4  4
1  2  2  1  4  3
2  2  3  1  3  1
4  2  1  4  3  2
5  4  3  1  3  1
6  2  4  2  1  1
7  2  3  2  2  1
8  2  4  2  1  3

## #03: Konversi tipe data string ke numerik pada kolom data frame

In [208]:
# Persiapan data frame
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}

df=pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [209]:
df.dtypes

col1    object
col2    object
dtype: object

In [210]:
# konversi tipe data dengan fungsi astype()
df_x = df.astype({'col2':'int64'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [211]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [212]:
# Konversi tipe data numerik dengan fungsi to_numeric()
df.apply(pd.to_numeric, errors ='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

## #04: Pemiliihan kolom (columns selection) pada pandas data frame berdasarkan tipe data

In [213]:
# Persiapan data frame
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df['bil_pecahan']=df['bil_pecahan'].astype('float')

df.index=pd.util.testing.makeDateIndex(n_rows, freq='H')
df=df.reset_index()

df['teks']=list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          8.0          4    A
1 2000-01-01 01:00:00          5.0          8    B
2 2000-01-01 02:00:00         11.0          3    C
3 2000-01-01 03:00:00          9.0          2    D
4 2000-01-01 04:00:00         16.0         16    E

In [214]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [215]:
# memilih kolom bertipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          8.0          4
1          5.0          8
2         11.0          3
3          9.0          2
4         16.0         16

In [216]:
df.select_dtypes(include='float')

   bil_pecahan
0          8.0
1          5.0
2         11.0
3          9.0
4         16.0

In [217]:
df.select_dtypes(include='int')

   bil_bulat
0          4
1          8
2          3
3          2
4         16

In [218]:
# Memilih kolom bertipe data string atau object
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [219]:
# Memilih kolom bertipe data datetime
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [220]:
# Memiliih kolom dengan kombinasi tipe data
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0          8.0          4    A
1          5.0          8    B
2         11.0          3    C
3          9.0          2    D
4         16.0         16    E

## #05: Membalik urutan baris dan kolom pada data frame

In [221]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  9  9  8  8  9
1  1  7  1  4  5
2  3  3  2  7  4
3  6  3  9  6  4
4  4  2  1  3  8

In [222]:
# Membalik urutan kolom
df.loc[:, ::-1]

   E  D  C  B  A
0  9  8  8  9  9
1  5  4  1  7  1
2  4  7  2  3  3
3  4  6  9  3  6
4  8  3  1  2  4

In [223]:
# Membalik urutan baris
df.loc[::-1]

   A  B  C  D  E
4  4  2  1  3  8
3  6  3  9  6  4
2  3  3  2  7  4
1  1  7  1  4  5
0  9  9  8  8  9

In [224]:
# Membalik urutan baris dan melakukan penyesuaian ulang index
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  4  2  1  3  8
1  6  3  9  6  4
2  3  3  2  7  4
3  1  7  1  4  5
4  9  9  8  8  9

## #06: Mengganti nama (label0 kolom pada data frame

In [225]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  7  3  8  3  4
1  2  9  2  8  2
2  2  4  1  7  9
3  5  3  8  8  9
4  2  5  6  4  1

In [226]:
# Mengganti nama (label) untuk sebuah kolom pada data frame
df.rename(columns={'C' : 'Hobi'})

   A  B  Hobi  D  E
0  7  3     8  3  4
1  2  9     2  8  2
2  2  4     1  7  9
3  5  3     8  8  9
4  2  5     6  4  1

In [227]:
# Mengganti nama (label) untuk banyak kolom pada data frame
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     7       3  8     3  4
1     2       9  2     8  2
2     2       4  1     7  9
3     5       3  8     8  9
4     2       5  6     4  1

## #07: Menghapus missing values pada data frame (NaN)

In [228]:
# Persiapan data frame
df = pd.util.testing.makeMissingDataframe().reset_index() #formula untuk bikin dummy data dengan missing values
df.head()

        index         A         B         C         D
0  HBrJCj9gLk  1.555927  1.797416 -0.210532  1.879198
1  RnHHS1Ubwh  1.414177 -1.380579 -0.998864 -0.113159
2  lFo1FSHFUl       NaN -1.402458 -0.372907  1.835968
3  rI4sElkpdf -0.876498  0.580091 -0.347503  0.001320
4  Pg5lh05FVP -0.419119       NaN  0.629323  0.104408

In [229]:
df = df.rename(columns={'index' : 'Z'})
df.head()

            Z         A         B         C         D
0  HBrJCj9gLk  1.555927  1.797416 -0.210532  1.879198
1  RnHHS1Ubwh  1.414177 -1.380579 -0.998864 -0.113159
2  lFo1FSHFUl       NaN -1.402458 -0.372907  1.835968
3  rI4sElkpdf -0.876498  0.580091 -0.347503  0.001320
4  Pg5lh05FVP -0.419119       NaN  0.629323  0.104408

In [230]:
df_backup = df.copy(deep=True)

In [231]:
# Menghapus (drop) setiap kolom yang mengandung missing values
df = df.dropna(axis='columns')
df.head()

            Z
0  HBrJCj9gLk
1  RnHHS1Ubwh
2  lFo1FSHFUl
3  rI4sElkpdf
4  Pg5lh05FVP

In [232]:
# Menghapus (drop) setiap baris yang mengandung missing values
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  HBrJCj9gLk  1.555927  1.797416 -0.210532  1.879198
1  RnHHS1Ubwh  1.414177 -1.380579 -0.998864 -0.113159
3  rI4sElkpdf -0.876498  0.580091 -0.347503  0.001320
5  9zjhYolUig -0.209115  0.210283  0.396650 -0.531543
7  eqPVBTrynT  0.639656  0.525422 -0.404686 -1.173018

In [233]:
# Persentase missing values untuk tiap kolom
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.066667
B    0.133333
C    0.100000
D    0.100000
dtype: float64

In [234]:
# Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan treshold / ambang batas (presentase missing value)
treshold = len(df)*0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         A         C         D
0  HBrJCj9gLk  1.555927 -0.210532  1.879198
1  RnHHS1Ubwh  1.414177 -0.998864 -0.113159
2  lFo1FSHFUl       NaN -0.372907  1.835968
3  rI4sElkpdf -0.876498 -0.347503  0.001320
4  Pg5lh05FVP -0.419119  0.629323  0.104408

## #08: Memeriksa kesamaan antar kolom (series) pada data frame

In [235]:
# Persiapan data frame
data  = {'A':[15, 15, 18, np.nan, 12],'B':[15, 15, 18, np.nan, 12]}
df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [236]:
# Mengenal pandas series
# data frame merupakan kumpulan dari data series
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [237]:
type(df['A'])

pandas.core.series.Series

In [238]:
type(df)

pandas.core.frame.DataFrame

In [239]:
# Memeriksa kesamaan dengan operator == (Tidak di rekomendasikan karena apabila dalam data teradap NaN maka akan tidak terbaca dengan baik)
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [240]:
# Memeriksa kesamaan dengan method equals() | Lebih di rekomendasikan
df['A'].equals(df['B'])

True

In [241]:
# Memeriksa kesamaan antar dua data frame
df1 = df.copy(deep=True)
df.equals(df1)

True

In [242]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

## #09: Membagi data frame menjadi dua secara acak

In [243]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0   6   8   2  13  12
1   1  15   6   8   9
2   4  13  15   3  10
3   4  13  10   7  13
4  15   6   6  19   3
5  10  19  12  15  16
6   5   1  10   8   5
7  19  13  19   6  11
8   2   3  17   5   4
9  12  16  16  15   5

In [244]:
# Membagi dua data frame menjadi dua secara acak berdasarkan proporsi tertentu
df.shape

(10, 5)

In [245]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 Shape: {df_1.shape}')
print(f'df_2 Shape: {df_2.shape}')

df_1 Shape: (7, 5)
df_2 Shape: (3, 5)

In [246]:
df_1

    A   B   C   D   E
4  15   6   6  19   3
1   1  15   6   8   9
2   4  13  15   3  10
0   6   8   2  13  12
9  12  16  16  15   5
6   5   1  10   8   5
7  19  13  19   6  11

In [247]:
df_2

    A   B   C   D   E
3   4  13  10   7  13
5  10  19  12  15  16
8   2   3  17   5   4

## #10: Mengganti nama (label) kolom pada data frame berdasarkan pola

In [248]:
# Persiapan data frame
df = pd.read_csv('./Dataset/titanicfull.csv')
df.columns = ['Pclass','Survival Status','Full Name','Sex','Age','Sib SP','parch','Ticket','Fare','Cabin','Embarked']
df_backup = df.copy(deep=True)
df.head()

,Pclass,Survival Status,Full Name,Sex,Age,Sib SP,parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S